In [4]:
import pandas as pd

In [8]:
df = pd.read_csv(r"./watch_folder/Partial.csv")
df

   index    A       B    C  D
0      0  1.0     Ram  1.0  1
1      2  3.0    Sita  4.0  3
2      4  4.0  Nikhil  5.0  6

In [ ]:
df.isnull()

In [13]:
pd.DataFrame(columns=['A','B']).to_csv('./Revised_Folder/hi.csv')

In [14]:
pd.read_csv('./watch_folder\\Partial.csv')

     A       B    C  D
0  1.0     Ram  1.0  1
1  2.0   Shyam  NaN  2
2  3.0    Sita  4.0  3
3  NaN   Divya  4.0  4
4  4.0  Nikhil  5.0  6